# hello!

# Умови
#
# n1, n2 = 10, 20 # множительное присвоение
# print(n1>n2)
# print(n1>=n2)
# print(n1<n2)
# print(n1<=n2)
# print(n1==n2) # вернёт Тру если два операнды равны
# print(n1!=n2) # вернёт Тру если два операнда разные

#

print(1 == 1 and 3 == 3)  #вернёт Тру если оба оператора равны, Фолс если нет
print(1 == 1 and 2 == 3) #вернёт Тру если хотяб один оператор равен другому, иначе нет

is_valid = False
print(is_valid)
print(not is_valid) # not > инверсия, если значение Фолс станет Тру, и наоборот

print("hello" in "hello world")